sysbench/examples/test/mysql_oltp_read_write.log
sysbench 1.1.0-faaff4f (using system LuaJIT 2.0.5)

Running the test with following options:
Number of threads: 32
Report intermediate results every 10 second(s)
Initializing random number generator from current time


Initializing worker threads...

Threads started!

[ 10s ] thds: 32 tps: 253.37 qps: 5098.20 (r/w/o: 3573.81/1014.46/509.93) lat (ms,95%): 244.38 err/s: 0.00 reconn/s: 0.00
[ 20s ] thds: 32 tps: 275.30 qps: 5520.04 (r/w/o: 3865.32/1104.11/550.60) lat (ms,95%): 219.36 err/s: 0.00 reconn/s: 0.00
[ 30s ] thds: 32 tps: 232.22 qps: 4642.13 (r/w/o: 3251.33/926.37/464.43) lat (ms,95%): 231.53 err/s: 0.00 reconn/s: 0.00
[ 40s ] thds: 32 tps: 255.09 qps: 5090.63 (r/w/o: 3559.88/1020.67/510.08) lat (ms,95%): 240.02 err/s: 0.00 reconn/s: 0.00
[ 50s ] thds: 32 tps: 271.38 qps: 5430.46 (r/w/o: 3802.19/1085.41/542.86) lat (ms,95%): 211.60 err/s: 0.00 reconn/s: 0.00
[ 60s ] thds: 32 tps: 267.99 qps: 5354.15 (r/w/o: 3746.19/1072.17/535.78) lat (ms,95%): 215.44 err/s: 0.00 reconn/s: 0.00
SQL statistics:
    queries performed:
        read:                            218190
        write:                           62340
        other:                           31170
        total:                           311700
    transactions:                        15585  (259.34 per sec.)
    queries:                             311700 (5186.81 per sec.)
    ignored errors:                      0      (0.00 per sec.)
    reconnects:                          0      (0.00 per sec.)

Throughput:
    events/s (eps):                      259.3405
    time elapsed:                        60.0947s
    total number of events:              15585

Latency (ms):
         min:                                   18.22
         avg:                                  123.30
         max:                                 1373.66
         95th percentile:                      227.40
         sum:                              1921558.53

Threads fairness:
    events (avg/stddev):           487.0312/13.37
    execution time (avg/stddev):   60.0487/0.03