sysbench/examples/test/mysql_run_oltp_read_write.log
sysbench 1.1.0-faaff4f (using system LuaJIT 2.0.5)

Running the test with following options:
Number of threads: 32
Report intermediate results every 10 second(s)
Initializing random number generator from current time


Initializing worker threads...

Threads started!

[ 10s ] thds: 32 tps: 371.77 qps: 7476.27 (r/w/o: 5241.33/1488.20/746.75) lat (ms,95%): 137.35 err/s: 0.00 reconn/s: 0.00
[ 20s ] thds: 32 tps: 408.20 qps: 8162.17 (r/w/o: 5711.75/1634.11/816.31) lat (ms,95%): 127.81 err/s: 0.00 reconn/s: 0.00
SQL statistics:
    queries performed:
        read:                            109648
        write:                           31328
        other:                           15664
        total:                           156640
    transactions:                        7832   (390.45 per sec.)
    queries:                             156640 (7809.08 per sec.)
    ignored errors:                      0      (0.00 per sec.)
    reconnects:                          0      (0.00 per sec.)

Throughput:
    events/s (eps):                      390.4539
    time elapsed:                        20.0587s
    total number of events:              7832

Latency (ms):
         min:                                   19.73
         avg:                                   81.84
         max:                                  255.92
         95th percentile:                      132.49
         sum:                               640977.47

Threads fairness:
    events (avg/stddev):           244.7500/8.96
    execution time (avg/stddev):   20.0305/0.02