sysbench/examples/test/mysql_run_oltp_update_non_index.log
sysbench 1.1.0-faaff4f (using system LuaJIT 2.0.5)

Running the test with following options:
Number of threads: 32
Report intermediate results every 10 second(s)
Initializing random number generator from current time


Initializing worker threads...

Threads started!

[ 10s ] thds: 32 tps: 5575.34 qps: 5575.34 (r/w/o: 0.00/5575.34/0.00) lat (ms,95%): 8.13 err/s: 0.00 reconn/s: 0.00
[ 20s ] thds: 30 tps: 5276.83 qps: 5276.83 (r/w/o: 0.00/5276.83/0.00) lat (ms,95%): 8.74 err/s: 0.00 reconn/s: 0.00
SQL statistics:
    queries performed:
        read:                            0
        write:                           108565
        other:                           0
        total:                           108565
    transactions:                        108565 (5419.53 per sec.)
    queries:                             108565 (5419.53 per sec.)
    ignored errors:                      0      (0.00 per sec.)
    reconnects:                          0      (0.00 per sec.)

Throughput:
    events/s (eps):                      5419.5259
    time elapsed:                        20.0322s
    total number of events:              108565

Latency (ms):
         min:                                    2.16
         avg:                                    5.90
         max:                                  213.91
         95th percentile:                        8.43
         sum:                               640017.92

Threads fairness:
    events (avg/stddev):           3392.6562/82.32
    execution time (avg/stddev):   20.0006/0.01