sysbench/examples/test/tidb_oltp_update_non_index.log
sysbench 1.1.0-faaff4f (using system LuaJIT 2.0.5)

Running the test with following options:
Number of threads: 32
Report intermediate results every 10 second(s)
Initializing random number generator from current time


Initializing worker threads...

Threads started!

[ 10s ] thds: 32 tps: 5251.89 qps: 5251.89 (r/w/o: 0.00/5251.89/0.00) lat (ms,95%): 11.04 err/s: 0.00 reconn/s: 0.00
[ 20s ] thds: 32 tps: 5679.84 qps: 5679.84 (r/w/o: 0.00/5679.84/0.00) lat (ms,95%): 8.28 err/s: 0.00 reconn/s: 0.00
[ 30s ] thds: 32 tps: 5449.65 qps: 5449.65 (r/w/o: 0.00/5449.65/0.00) lat (ms,95%): 7.70 err/s: 0.00 reconn/s: 0.00
[ 40s ] thds: 32 tps: 5200.91 qps: 5200.91 (r/w/o: 0.00/5200.91/0.00) lat (ms,95%): 8.13 err/s: 0.00 reconn/s: 0.00
[ 50s ] thds: 32 tps: 4876.07 qps: 4876.07 (r/w/o: 0.00/4876.07/0.00) lat (ms,95%): 9.39 err/s: 0.00 reconn/s: 0.00
[ 60s ] thds: 32 tps: 4826.80 qps: 4826.80 (r/w/o: 0.00/4826.80/0.00) lat (ms,95%): 9.73 err/s: 0.00 reconn/s: 0.00
SQL statistics:
    queries performed:
        read:                            0
        write:                           312896
        other:                           0
        total:                           312896
    transactions:                        312896 (5214.24 per sec.)
    queries:                             312896 (5214.24 per sec.)
    ignored errors:                      0      (0.00 per sec.)
    reconnects:                          0      (0.00 per sec.)

Throughput:
    events/s (eps):                      5214.2391
    time elapsed:                        60.0080s
    total number of events:              312896

Latency (ms):
         min:                                    2.38
         avg:                                    6.14
         max:                                   74.56
         95th percentile:                        9.06
         sum:                              1919850.08

Threads fairness:
    events (avg/stddev):           9778.0000/11.68
    execution time (avg/stddev):   59.9953/0.00